from django.shortcuts import render
from django.http import HttpResponse


# Create your views here.
def home(request):
    return render(request, 'blog/home.html')


blog_post = [
    {
         "title": "মন্ত্রীর সমালোচনা করা নদী কমিশনের চেয়ারম্যান মনজুরকে সরিয়ে দেওয়া হলো",
         "content": "মেয়াদ শেষ হওয়ার আগেই জাতীয় নদী রক্ষা কমিশনের চেয়ারম্যান মনজুর আহমেদ চৌধুরীকে দায়িত্ব থেকে সরিয়ে দিয়েছে সরকার।"
                    " আজ বুধবার তাঁর চুক্তিভিত্তিক নিয়োগ বাতিল করা হয়েছে। জনপ্রশাসন মন্ত্রণালয়ের এক প্রজ্ঞাপনে বলা হয়, জাতীয় নদী রক্ষা কমিশনের"
                    " চেয়ারম্যান মনজুর আহমেদ চৌধুরীর চুক্তিভিত্তিক নিয়োগের অবশিষ্ট মেয়াদ জনস্বার্থে বাতিল করা হলো।",
         "author": "pinaki",
         "date posted": "18 october 2023",

    },
    {   "title": "৬ বিসিএসে নিয়োগ পেয়েছেন ৭ হাজার ১৬১ জন নারী ক্যাডার",
        "content": "সরকারি কর্ম কমিশনের (পিএসসি) মাধ্যমে সর্বশেষ ছয়টি বিসিএসে ৭ হাজার ১৬১ জন নারী"
                   " বাংলাদেশ সিভিল সার্ভিসের বিভিন্ন ক্যাডারে যোগ দিয়েছেন। জনপ্রশাসন মন্ত্রণালয়ের বার্ষিক প্রতিবেদনে (২০২২-২৩) তথ্য প্রকাশ করা হয়েছে।"
                   " ১১ অক্টোবর জনপ্রশাসন মন্ত্রণালয় বার্ষিক প্রতিবেদনটি প্রকাশ করে।",
        "author ": "Citizens of Bangladesh",
        "date_posted": "18 october 2023",
    },
]

def about(request):
    return render(request, 'blog/about.html',{"blog_post": blog_post})
